The GUID to use for identifying connection geometry generation algorithm.
  Namespace:   Autodesk.Revit.DB.Structure
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
  Since:  2017
 Syntax
  C#
public Guid ConnectionGuid { get; }
  Visual Basic
Public ReadOnly Property ConnectionGuid As Guid
	Get
  Visual C++
public:
property Guid ConnectionGuid {
	Guid get ();
}
 See Also
  StructuralConnectionHandlerType Class
  Autodesk.Revit.DB.Structure Namespace